import React from "react";

export const dummyData = [
  {
    '연도': "2022",                // 연도
    '순이익': 25418778000000,  // 순이익
    '영업이익': 25319329000000, // 영업이익
    '매출액': 211867483000000,   // 매출액
    '부채총계': 50667559000000, // 부채총계
    '자본총계': 209416191000000,     // 자본총계
    '유동자산': 59062658000000,    // 유동자산
    '유동부채': 46086047000000, // 유동부채
    'ROE': 12.14,                   // 자기자본이익률 (Return on Equity)
    'ROA': 9.77,                    // 총자산이익률 (Return on Assets)
    '영업이익률': 11.95,       // 영업이익률
    '매출액순이익률': 12.0,        // 매출액순이익률
    '부채비율': 24.19,             // 부채비율
    '유동비율': 128.16,         // 유동비율
    '자기자본비율': 80.52,           // 자기자본비율
    '레버리지비율': 124.19         // 레버리지비율
  },
  {
    '연도': "2023",
    '순이익': 25397099000000,  
    '영업이익': -11526297000000,
    '매출액': 170374090000000,   
    '부채총계': 72069515000000,
    '자본총계': 224787774000000,
    '유동자산': 68548442000000,
    '유동부채': 41775101000000,
    'ROE': 11.3,                   
    'ROA': 8.56,                   
    '영업이익률': -6.77,      
    '매출액순이익률': 14.91,      
    '부채비율': 32.06,            
    '유동비율': 164.09,        
    '자기자본비율': 75.72,          
    '레버리지비율': 132.06        
  },
  {
    '연도': "2024",
    '순이익': 23582565000000,
    '영업이익': 12361034000000,
    '매출액': 209052241000000,
    '부채총계': 88569470000000,
    '자본총계': 236396657000000,
    '유동자산': 82320322000000,
    '유동부채': 80157976000000,
    'ROE': 9.98,                   
    'ROA': 7.26,                   
    '영업이익률': 5.91,       
    '매출액순이익률': 11.28,      
    '부채비율': 37.47,            
    '유동비율': 102.7,         
    '자기자본비율': 72.75,          
    '레버리지비율': 137.47        
  }
]
